src/Documents/уатПакетСопроводительныхДокументов/уатПакетСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатПакетСопроводительныхДокументов</name>
  <registerRecords>InformationRegister.уатСтатусыСопроводительныхДокументов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дополнительно</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтправления</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОтправку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтправления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПолучения</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПолучения</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПолучение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПолучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СопроводительныеДокументы</name>
    <attributes>
      <name>СопроводительныйДокумент</name>
      <type>
        <types>CatalogRef.уатСопроводительныеДокументы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиУведомлений</name>
    <attributes>
      <name>ВидУведомления</name>
      <type>
        <types>CatalogRef.уатСпособыВзаимодействий_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>String</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПолучателя</name>
      <type>
        <types>EnumRef.уатТипыПолучателейУведомлений_уэ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПосылатьУведомления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатТипыСобытийДляУведомления_уэ/уатТипыСобытийДляУведомления_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыСобытийДляУведомления_уэ</name>
  <enumValues>
    <name>ЗагрузкаИзМониторинга</name>
  </enumValues>
  <enumValues>
    <name>ЗакреплениеМаршрутногоЛистаЗаПеревозчиком</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеВесообъемныхХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеВодителя</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПунктовМаршрута</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаГрузовогоМеста</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОтветаПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОтправления</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаПолучения</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаРодительскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеТС</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаСобытия</name>
  </enumValues>
  <enumValues>
    <name>ПрибытиеВПунктПланИзменено</name>
  </enumValues>
  <enumValues>
    <name>ПрибытиеВПунктФактИзменено</name>
  </enumValues>
  <enumValues>
    <name>ПрогнозОпозданияПоМаршрутномуЛисту</name>
  </enumValues>
  <enumValues>
    <name>РасхожденияПоСкладскомуАкту</name>
  </enumValues>
  <enumValues>
    <name>УбытиеИзПунктаПланИзменено</name>
  </enumValues>
  <enumValues>
    <name>УбытиеИзПунктаФактИзменено</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПеревозчикуПоСопроводительнымДокументам</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатПакетСопроводительныхДокументов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.уатПакетСопроводительныхДокументов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение_проф.ОтразитьСтатусыСопроводительныхДокументов(ДополнительныеСвойства, Движения, Отказ);
	
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатПакетСопроводительныхДокументов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);

	уатУчетОригиналовПервичныхДокументов.СформироватьДвиженияРеестрДокументов(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Отправлен Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОтправления");
	КонецЕсли;
	Если Получен Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаПолучения");
	КонецЕсли;
	
	// проверка наличия шаблонов в ТЧ
	Для Каждого ТекСтрока Из СопроводительныеДокументы Цикл
		Если ТекСтрока.СопроводительныйДокумент.Шаблон Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("В табличной части ""Сопроводительные документы"" не должно быть шаблонов.", Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Уведомления
	Если Не Отказ 
		И Не ПометкаУдаления 
		И ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
		// Заполнение ТЧ "Получатели уведомлений"
		Если Модифицированность() Тогда
			тблПолучатели = уатОбщегоНазначения_уэ.СформироватьСписокПолучателейУведомлений(ЭтотОбъект);
			ПолучателиУведомлений.Загрузить(тблПолучатели);
		КонецЕсли;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			// Отслеживаем событие "Изменение статуса отправления"
			Если Ссылка.СтатусОтправления <> СтатусОтправления Тогда
				ДополнительныеСвойства.Вставить("флИзменениеСтатусаОтправления");
			КонецЕсли;
			// Отслеживаем событие "Изменение статуса получения"
			Если Ссылка.СтатусПолучения <> СтатусПолучения Тогда
				ДополнительныеСвойства.Вставить("флИзменениеСтатусаПолучения");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("флИзменениеСтатусаОтправления") Тогда
		уатОбщегоНазначения_уэ.СформироватьУведомление(Ссылка, Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаОтправления);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("флИзменениеСтатусаПолучения") Тогда
		уатОбщегоНазначения_уэ.СформироватьУведомление(Ссылка, Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаПолучения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
